{
  "AboutMe.title": "A Few Words About Me",
  "AboutMe.subTitle": "Software Engineer driven by innovation -",
  "AboutMe.bodyCopyOne": "I'm a passionate Software Engineer located in North Dakota, constantly embacing new challenges whenever I can.",
  "AboutMe.bodyCopyTwo": "Hardworking professional with a broad technical skill set. Excellent communicator experienced in interpreting and implementing visions to meet the needs of the business. Known for the ability to efficiently manage multiple pressing projects simultaneously, consistently meeting deadlines and exceeding expectations. Excels in environments that constantly present new challenges.",
  "AboutMe.sectionHeader": "I'm good at:",
  "AboutMe.sectionCopyOne": "Problem Solving",
  "AboutMe.sectionCopyTwo": "Communicating",
  "AboutMe.sectionCopyThree": "Project Management",
  "AboutMe.sectionCopyFour": "Writing Clean Code",
  "AboutMe.sectionCopyFive": "Organization",
  "AboutMe.portfolioButton": "Portfolio",
  "Contributions.title": "Cool Contributions",
  "Contributions.subtitle": "As a professional software engineer, I've had the opportunity to work on some pretty awesome projects.",
  "Contributions.landtrustCopy": "LandTrust Projects:",
  "Contributions.personalCopy": "Personal Projects:",
  "Contributions.fieldnotes": "I created a robust social feed for landowners to share updates about their properties, with support for images and videos. Users can engage with posts through likes, share updates with friends, and follow properties to receive notifications for new posts. I owned this project from start to finish, handling everything from designing the database schema and implementing the queries, mutations, and resolvers that power the feed, to building the user interface.",
  "Contributions.homepage": "I implemented a full redesign of our homepage, introducing several key features. I created a \"Near You\" section that displays hunting experiences based on users' geolocation. I added a \"Recently Viewed\" section, leveraging local storage to display the latest packages users have viewed. I also developed a \"Favorited Packages\" section and created an \"Early Access Packages\" section that highlights packages with early access availability.",
  "Contributions.listingPage": "I completely redesigned both the package and listing pages, handling nearly every visual aspect. Almost everything the user interacts with was either built by me or extensively modified. I developed the sections displayed, built new modal components, created custom image carousels, and created new tooltip components.",
  "Header.title": "Hello, I'm Sebastien!",
  "Header.subTitle": "Software Engineer at LandTrust",
  "Header.contactButton": "Contact Me",
  "Navbar.firstName": "Sebastien Zasada",
  "Navbar.title": "Sofware Engineer",
  "Navbar.contactCta": "Write Me",
  "Navbar.emailCta": "sezasada@icloud.com",
  "Navbar.phoneCta": "Call Me",
  "Navbar.phoneNumberCta": "+1 (218) 790 0487",
  "Navbar.aboutMe": "About Me",
  "Navbar.projects": "Featured Projects",
  "Navbar.testimonials": "Testimonials",
  "Navbar.contactMe": "Contact Me",
  "Skills.javascript": "JavaScript",
  "Skills.typescript": "TypeScript",
  "Skills.graphql": "GraphQL",
  "Skills.html": "HTML",
  "Skills.css": "CSS",
  "Skills.redux": "Redux",
  "Skills.react": "React",
  "Skills.next": "Next",
  "Skills.aws": "AWS",
  "Skills.tailwind": "Tailwind",
  "Skills.title": "Core Competencies"
}
