{
  "AboutMe.title": "A Few Words About Me",
  "AboutMe.subTitle": "Software Engineer driven by innovation -",
"AboutMe.bodyCopyOne": "I'm a Software Engineer based in Fargo, North Dakota, driven by a passion for building impactful products that leave a lasting mark on the people who use them.",
  "AboutMe.bodyCopyTwo": "Hardworking professional with a broad technical skill set. Excellent communicator experienced in interpreting and implementing visions to meet the needs of the business. Known for the ability to efficiently manage multiple pressing projects simultaneously, consistently meeting deadlines and exceeding expectations. Excels in environments that constantly present new challenges.",
  "AboutMe.sectionHeader": "I'm good at:",
  "AboutMe.sectionCopyOne": "Problem Solving",
  "AboutMe.sectionCopyTwo": "Communicating",
  "AboutMe.sectionCopyThree": "Project Management",
  "AboutMe.sectionCopyFour": "Writing Clean Code",
  "AboutMe.sectionCopyFive": "Organization",
  "AboutMe.portfolioButton": "Portfolio",
  "ChatBot.title": "What can I help with?",
  "ChatBot.placeholder": "Message ChatGPT",
  "ContactMe.title": "Let's Get In Touch",
  "ContactMe.subtitle": "Contact me in any convenient way to discuss how I can provide value to your business",
  "ContactMe.writeMe": "WRITE ME -",
  "ContactMe.emailAddress": "sezasada@icloud.com",
  "ContactMe.phoneNumber": "+1 (218) 790 0487",
  "ContactMe.linkedinUsername": "www.linkedin.com/in/sebastien-zasada",
  "ContactMe.callMe": "CALL ME -",
  "ContactMe.findMe": "FIND ME -",
  "Contributions.title": "Cool Contributions",
  "Contributions.subtitle": "As a professional software engineer, I've had the opportunity to work on some pretty awesome projects.",
  "Contributions.landtrustCopy": "LandTrust Projects:",
  "Contributions.fieldnotesTitle": "Field Notes",
  "Contributions.visitButton": "Visit",
  "Contributions.codeButton": "Code",
  "Contributions.homepageTitle": "Homepage Redesign",
  "Contributions.listingPageRedesignTitle": "Listing Page Redesign",
  "Contributions.marketWatcherTitle": "Market Watcher",
  "Contributions.farmWorksTitle": "Farm Works",
  "Contributions.chatbotTitle": "ChatBot",
  "Contributions.fieldnotesLink": "https://landtrust.com/fieldnotes",
  "Contributions.homepageLink": "https://landtrust.com",
  "Contributions.listingPageLink": "https://landtrust.com/l/sheehy-ranch/62156d20-7762-48d2-aa67-e0f89a7a3552",
  "Contributions.personalCopy": "Personal Projects:",
  "Contributions.chatbot": "This application is an AI-driven chatbot designed to deliver dynamic and responsive communication. Built using React.js for the frontend, it provides a seamless user experience with modern and modular design principles. The backend is powered by C# and ASP.NET Core, hosted on Azure App Service, the application benefits from high availability and scalability, making it suitable for both personal and enterprise use. The chatbot leverages OpenAI's GPT-4o model for natural language processing, enabling it to understand and respond to user queries effectively. The application employs secure RESTful architecture for seamless communication between the client and server. Deployed using Vercel for the frontend, designed for real-time interactions, the ChatBot application showcases a perfect blend of AI, cloud technology, and modern software engineering practices.",
  "Contributions.farmWorks": "Farm in the Dell of the Red River Valley is a non-profit organization that was tracking their tasks around the farm on a whiteboard. This led to some issues of knowing who was responsible for what and what kind of tasks could be done during a specific day. This application is designed to streamline their process of task management. Helping to delegate tasks and keep track of what tasks are going on and who is doing them.",
  "Contributions.marketWatcher": "Market Watcher is a comprehensive web application designed to provide users with seamless access to the latest earnings reports, financial data, and news for NASDAQ-listed companies. By simply entering a company name or symbol and selecting a time frame, users can quickly view relevant earnings reports. The user-friendly watchlist feature allows users to add stocks with a single click and conveniently rename their watchlist by clicking the pencil icon. The ticker bar at the top of the page displays all the stocks in a user's watchlist, and clicking on any ticker redirects the user to Trading View for in-depth data analysis and charting. All stock data, news articles, and earnings reports are consistently up to date through APIs.",
  "Contributions.fieldnotes": "I created a robust social feed for landowners to share updates about their properties, with support for images and videos. Users can engage with posts through likes, share updates with friends, and follow properties to receive notifications for new posts. I owned this project from start to finish, handling everything from designing the database schema and implementing the queries, mutations, and resolvers that power the feed, to building the user interface.",
  "Contributions.homepage": "I implemented a full redesign of our homepage, introducing several key features. I created a \"Near You\" section that displays hunting experiences based on users' geolocation. I added a \"Recently Viewed\" section, leveraging local storage to display the latest packages users have viewed. I also developed a \"Favorited Packages\" section and created an \"Early Access Packages\" section that highlights packages with early access availability.",
  "Contributions.listingPage": "I completely redesigned both the package and listing pages, handling nearly every visual aspect. Almost everything the user interacts with was either built by me or extensively modified. I developed the sections displayed, built new modal components, created custom image carousels, and created new tooltip components.",
  "Footer.createdBy": "Created by",
  "Footer.rights": "All rights reserved",
  "Header.title": "Hello, I'm Sebastien!",
  "Header.subTitle": "Software Engineer at Scheels",
  "Header.contactButton": "Contact Me",
  "Homepage.mobileMessage": "I'm sorry, this site is not mobile compatible yet! Please visit this page again on your computer.",
  "Navbar.firstName": "Sebastien Zasada",
  "Navbar.title": "Software Engineer",
  "Navbar.contactCta": "Write Me",
  "Navbar.emailCta": "sezasada@icloud.com",
  "Navbar.phoneCta": "Call Me",
  "Navbar.phoneNumberCta": "+1 (218) 790 0487",
  "Navbar.aboutMe": "About Me",
  "Navbar.projects": "Featured Projects",
  "Navbar.testimonials": "Testimonials",
  "Navbar.contactMe": "Contact Me",
  "Navbar.linkedin": "Linkedin",
  "Navbar.github": "GitHub",
  "Navbar.instagram": "Instagram",
  "Resume.title": "Resume",
  "Skills.javascript": "JavaScript",
  "Skills.typescript": "TypeScript",
  "Skills.csharp": "C#",
  "Skills.graphql": "GraphQL",
  "Skills.html": "HTML",
  "Skills.css": "CSS",
  "Skills.redux": "Redux",
  "Skills.react": "React",
  "Skills.next": "Next",
  "Skills.aws": "AWS",
  "Skills.tailwind": "Tailwind",
  "Skills.title": "Core Competencies",
  "Testimonials.title": "Words From My Coworkers",
  "Testimonials.subtitle": "I've had the pleasure of working with some very talented people. Here's what they have to say about me.",
  "Testimonials.cody": "Cody Hebert",
  "Testimonials.codyJobTitle": "Product Lead At LandTrust",
  "Testimonials.codyReferral": "\"I worked with Sebastien at LandTrust for over a year, and it was incredible to see how quickly he picked up speed and started pushing code that solved customer pain points. Sebastien not only knocked out our entire backlog of to-dos in under two months but then asked for more and was always ready to work outside his comfort zone. He is extremely detail oriented and required very little guidance on every project we worked on together. He was attentive in every meeting where I outlined design specs and actively asked questions, ensuring the highest quality output of the proposed solution. I enjoyed getting to know Sebastien virtually and in the company on-site at HQ in Montana! If you are looking for an engineer with an extreme work ethic and a self-driven approach, Sebastien is your guy! I highly recommend him for every team.\"",
  "Testimonials.josh": "Josh Hinton",
  "Testimonials.joshJobTitle": "Software Engineer",
  "Testimonials.joshReferral": "\"There are so many great things to say about Sebastien that it's hard to know where to begin. I've had the pleasure of mentoring Sebastien over the past year at LandTrust. He joined as a Junior Engineer with little real-world engineering experience but the right attitude. Sebastien took every day as an opportunity to learn something new and perfect what he already knew. He was always the first to volunteer for any task and gave his best effort to maximize his potential. By the end of his first year, Sebastien had gained more experience pushing code and providing solutions for both front-end and back-end than most Junior Engineers acquire in 3-5 years. Sebastien's attitude, work ethic, and drive make him a huge asset, and he's only getting started. I fully recommend Sebastien to anyone looking to elevate their efforts. He brings not just real-world experience, but also the fire and passion needed to excel in any role. Do yourself a favor and hire Sebastien quickly before another company gains this tremendous asset.\"",
  "Testimonials.nic": "Nic De Castro",
  "Testimonials.nicJobTitle": "CEO",
  "Testimonials.nicReferral": "\"I could not give Sebastien a higher recommendation. LandTrust was his first job straight out of software boot camp. He came in hungry, wanting to attack and learn as much as possible. He quickly became an integral part of the team and someone who you knew would get his projects and then some done. Fantastic team player and individual contributor. Sebastien will be greatly missed and we'll be rooting for him as he charts the next course in his career journey!\"",
  "Testimonials.rob": "Rob Rotarius",
  "Testimonials.robJobTitle": "CTO",
  "Testimonials.robReferral": "\"I had the pleasure of working with Sebastien during the early stages of his career, and it's clear he is someone with incredible potential. Sebastien approaches every task with eagerness and motivation, and he is not afraid to ask questions to deepen his understanding. I have no doubt Sebastien will continue to thrive and make meaningful contributions wherever his career takes him.\""
}
